---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors
source: html/315e4d13-615d-24a2-84b7-b5a47f2170d9.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors Method

Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries
 object due to errors.

## Syntax (C#)
```csharp
public IList<KeyBasedTreeEntryError> GetKeyBasedTreeEntryErrors()
```

## Returns
An array of copies of the KeyBasedTreeEntryErrors contained in this object.